## Conceitos e criação de DataFrame I

In [1]:
import pandas as pd

In [5]:
#DataFrame criado a partir de um Dicionario de lista
dados ={
    'empresa': ['Revista Exame', 'Let\'s Code', 'Google', 'Nasa'],
    'n_funcionarios': [30, 20, 40, 25],
    'capital': [10000, 20000, 7000, 12000]
}

In [6]:
df = pd.DataFrame(dados)
df

         empresa  n_funcionarios  capital
0  Revista Exame              30    10000
1     Let's Code              20    20000
2         Google              40     7000
3           Nasa              25    12000

In [17]:
#DataFrame criado a partir de Lista de Dicionarios
dados = [
    {
    'empresa': ['Let\'s Code'],
    'n_funcionarios': [30],
    'capital': [10000]
    },
    {
    'empresa': ['Exame'],
    'n_funcionarios': [20],
    'capital': [20000]    
    }
]

In [10]:
df = pd.DataFrame(dados)
df

        empresa n_funcionarios  capital
0  [Let's Code]           [30]  [10000]
1       [Exame]           [20]  [20000]

In [14]:
#DataFrame criado a partir de Tuplas
dados = [
    ('Let\'s Code', 20, 10000),
    ('Revista Exame', 25, 20000)
]

df = pd.DataFrame(dados, columns = ['empresa', 'n_funcionarios', 'capital'])
df

         empresa  n_funcionarios  capital
0     Let's Code              20    10000
1  Revista Exame              25    20000

## Conceitos e criação de DataFrame II

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   empresa         2 non-null      object
 1   n_funcionarios  2 non-null      int64
 2   capital         2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [16]:
df.describe()

       n_funcionarios       capital
count        2.000000      2.000000
mean        22.500000  15000.000000
std          3.535534   7071.067812
min         20.000000  10000.000000
25%         21.250000  12500.000000
50%         22.500000  15000.000000
75%         23.750000  17500.000000
max         25.000000  20000.000000